# Lab 1
### Learning outcomes 
Upon successful completion of this lab, you will have demonstrated the abilities to: 
1.	Loading a dataset into a pandas dataframe
2.	Counting how many rows and columns were loaded
3.	Determining which type of data was loaded
4.	Looking at different parts of the data by subsetting rows and columns
5.	Working with Data Series

#### Before you start
Load the diabetes dataset

## Run this cell, look at the output for each command to make sure you understand the purpose of each command
from sklearn.datasets import load_diabetes
import pandas as pd

diabetes=load_diabetes()
print(diabetes.keys())
print(diabetes.DESCR)
print(diabetes.feature_names) # these are the column names
# attach the feature names to the data as column names
df=pd.DataFrame(diabetes.data, columns=diabetes.feature_names)

1. print the number of rows and columns in the dataset using the shape attribute of the dataframe object

In [18]:
import pandas as pd

from sklearn.datasets import load_diabetes

2. print the first 5 observations of the dataset.

In [20]:
#Read from the csv file into a DataFrame Object
diabetes = load_diabetes()

diabetes=pd.DataFrame(diabetes.data, columns=diabetes.feature_names)
diabetes
diabetes.head()

,age,sex,bmi,bp,s1,s2,s3,s4,s5,s6
0,0.038076,0.050680,0.061696,0.021872,-0.044223,-0.034821,-0.043401,-0.002592,0.019907,-0.017646
1,-0.001882,-0.044642,-0.051474,-0.026328,-0.008449,-0.019163,0.074412,-0.039493,-0.068332,-0.092204
2,0.085299,0.050680,0.044451,-0.005670,-0.045599,-0.034194,-0.032356,-0.002592,0.002861,-0.025930
3,-0.089063,-0.044642,-0.011595,-0.036656,0.012191,0.024991,-0.036038,0.034309,0.022688,-0.009362
4,0.005383,-0.044642,-0.036385,0.021872,0.003935,0.015596,0.008142,-0.002592,-0.031988,-0.046641

3. print the column names of the dataset

In [21]:
# list(diabetes)
list(diabetes.columns)

['age', 'sex', 'bmi', 'bp', 's1', 's2', 's3', 's4', 's5', 's6']

4. get the dtype of each column

In [22]:
# check data types of columns
diabetes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 442 entries, 0 to 441
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   age     442 non-null    float64
 1   sex     442 non-null    float64
 2   bmi     442 non-null    float64
 3   bp      442 non-null    float64
 4   s1      442 non-null    float64
 5   s2      442 non-null    float64
 6   s3      442 non-null    float64
 7   s4      442 non-null    float64
 8   s5      442 non-null    float64
 9   s6      442 non-null    float64
dtypes: float64(10)
memory usage: 34.7 KB

5. use loc to show the second row of the dataset.

In [23]:
#use loc 1st and 2nd row of dataset
first_row = diabetes.loc[0]
second_row = diabetes.loc[1]

print("First row:\n", first_row)
print("\nSecond row:\n", second_row)

First row:
 age    0.038076
sex    0.050680
bmi    0.061696
bp     0.021872
s1    -0.044223
s2    -0.034821
s3    -0.043401
s4    -0.002592
s5     0.019907
s6    -0.017646
Name: 0, dtype: float64

Second row:
 age   -0.001882
sex   -0.044642
bmi   -0.051474
bp    -0.026328
s1    -0.008449
s2    -0.019163
s3     0.074412
s4    -0.039493
s5    -0.068332
s6    -0.092204
Name: 1, dtype: float64

6. use loc to show the second, 100th and 150th rows of the dataset

In [25]:
second_row = diabetes.loc[1]
hundredth_row = diabetes.loc[99]
one_fiftyth_row = diabetes.loc[149]

print("Second row:\n", second_row)
print("\nHundredth row:\n", hundredth_row)
print("\nOne_fifteth row:\n", one_fiftyth_row)

Second row:
 age   -0.001882
sex   -0.044642
bmi   -0.051474
bp    -0.026328
s1    -0.008449
s2    -0.019163
s3     0.074412
s4    -0.039493
s5    -0.068332
s6    -0.092204
Name: 1, dtype: float64

Hundredth row:
 age   -0.001882
sex   -0.044642
bmi   -0.064408
bp     0.011544
s1     0.027326
s2     0.037517
s3    -0.013948
s4     0.034309
s5     0.011785
s6    -0.054925
Name: 99, dtype: float64

One_fifteth row:
 age   -0.049105
sex    0.050680
bmi   -0.005128
bp    -0.046985
s1    -0.020832
s2    -0.020416
s3    -0.069172
s4     0.071210
s5     0.061238
s6    -0.038357
Name: 149, dtype: float64

7. use iloc to show the the second and 100th rows of the dataset

In [26]:
second_row = diabetes.iloc[1]
hundredth_row = diabetes.iloc[99]

print("Second row:\n", second_row)
print("\nHundredth row:\n", hundredth_row)

Second row:
 age   -0.001882
sex   -0.044642
bmi   -0.051474
bp    -0.026328
s1    -0.008449
s2    -0.019163
s3     0.074412
s4    -0.039493
s5    -0.068332
s6    -0.092204
Name: 1, dtype: float64

Hundredth row:
 age   -0.001882
sex   -0.044642
bmi   -0.064408
bp     0.011544
s1     0.027326
s2     0.037517
s3    -0.013948
s4     0.034309
s5     0.011785
s6    -0.054925
Name: 99, dtype: float64

8. use loc to show the bmi column of the dataset

In [27]:
# Use loc to show the BMI column
diabetes.loc[:, ["bmi"]]

          bmi
0    0.061696
1   -0.051474
2    0.044451
3   -0.011595
4   -0.036385
..        ...
437  0.019662
438 -0.015906
439 -0.015906
440  0.039062
441 -0.073030

[442 rows x 1 columns]

9. Use loc to show the bmi, bp columns of the dataset

In [28]:
# Use loc to show the BP column
diabetes.loc[:,["bmi", "bp"]]

          bmi        bp
0    0.061696  0.021872
1   -0.051474 -0.026328
2    0.044451 -0.005670
3   -0.011595 -0.036656
4   -0.036385  0.021872
..        ...       ...
437  0.019662  0.059744
438 -0.015906 -0.067642
439 -0.015906  0.017293
440  0.039062  0.001215
441 -0.073030 -0.081413

[442 rows x 2 columns]

10. use iloc to show the last row of the dataset

In [30]:
# show last row of dataset
last_row=diabetes.iloc[-1]
print(last_row)

age   -0.045472
sex   -0.044642
bmi   -0.073030
bp    -0.081413
s1     0.083740
s2     0.027809
s3     0.173816
s4    -0.039493
s5    -0.004222
s6     0.003064
Name: 441, dtype: float64

11. Use iloc to show the last two observations of the dataset

In [35]:
last_two_obs=diabetes.iloc[-2:]
print(last_two_obs)

          age       sex       bmi        bp        s1        s2        s3  \
440 -0.045472 -0.044642  0.039062  0.001215  0.016318  0.015283 -0.028674
441 -0.045472 -0.044642 -0.073030 -0.081413  0.083740  0.027809  0.173816

           s4        s5        s6
440  0.026560  0.044529 -0.025930
441 -0.039493 -0.004222  0.003064

12. use loc to create a subset of the first 10 obs for age,bmi,bp columns. Then show the first 5 obs of the subset dataframe.

In [90]:
# loc to create a subset of the first 10 obs for age,bmi, bp columns
df = diabetes.loc[0:9,["age", "bmi", "bp"]]
print(df)

#showing first 5 obs of the subset data frame
subset_diabetes = df[["age", "bmi", "bp"]]
first_five_obs = subset_diabetes[:5]
first_five_obs.head(5)
#print(first_five_obs)

        age       bmi        bp
0  0.038076  0.061696  0.021872
1 -0.001882 -0.051474 -0.026328
2  0.085299  0.044451 -0.005670
3 -0.089063 -0.011595 -0.036656
4  0.005383 -0.036385  0.021872
5 -0.092695 -0.040696 -0.019442
6 -0.045472 -0.047163 -0.015999
7  0.063504 -0.001895  0.066629
8  0.041708  0.061696 -0.040099
9 -0.070900  0.039062 -0.033213

        age       bmi        bp
0  0.038076  0.061696  0.021872
1 -0.001882 -0.051474 -0.026328
2  0.085299  0.044451 -0.005670
3 -0.089063 -0.011595 -0.036656
4  0.005383 -0.036385  0.021872

13. Use iloc and slicing columns method with colon (:) to slice the first 6 columns of the dataset)keep all rows). Save the sliced subset in dataframe subset, then show the first 5 obs of dataframe subset.

In [102]:
# using iloc to slice first 6 columns 
first_six_columns = diabetes.iloc[:, :6]

#showing the first 5 obs of data frame subset.   
first_six_columns.head(5)

        age       bmi        bp
0  0.038076  0.061696  0.021872
1 -0.001882 -0.051474 -0.026328
2  0.085299  0.044451 -0.005670
3 -0.089063 -0.011595 -0.036656
4  0.005383 -0.036385  0.021872

14. slice columns 3 to 5 inclusive into dataframe subset. then show the first 5 obs of dataframe subset.

In [99]:
# slice columns 3 to 5 inclusive
df = diabetes.iloc[:, 2:5+1]

# show the first 5 obs of data frame subset
df.head(5)

         bp
0  0.021872
1 -0.026328
2 -0.005670
3 -0.036656
4  0.021872

15. use iloc and slice every other column up to 5 inclusive into a dataframe subset. Then show the first 5 obs of the dataframe subset.

In [104]:
# iloc to slice columns up to 5 inclusive
df = diabetes.iloc[:, :5+1]

# show the first 5 obs of data frame subset
df.head(5)

        age       bmi        bp
0  0.038076  0.061696  0.021872
1 -0.001882 -0.051474 -0.026328
2  0.085299  0.044451 -0.005670
3 -0.089063 -0.011595 -0.036656
4  0.005383 -0.036385  0.021872

16. Use loc to display the age for the 10th row of the dataframe.

In [83]:
row = [10]
diabetes.loc[row]

,age,sex,bmi,bp,s1,s2,s3,s4,s5,s6
10,-0.096328,-0.044642,-0.083808,0.008101,-0.103389,-0.090561,-0.013948,-0.076395,-0.062917,-0.034215

17. Use loc to display the bmi for row numbers 100, 200 and 300.

In [82]:
rows = [100,200,300]
diabetes.loc[rows]

,age,sex,bmi,bp,s1,s2,s3,s4,s5,s6
100,0.016281,-0.044642,0.017506,-0.022885,0.060349,0.044406,0.030232,-0.002592,0.037236,-0.001078
200,0.056239,-0.044642,-0.057941,-0.007977,0.052093,0.049103,0.056003,-0.021412,-0.028323,0.044485
300,0.016281,-0.044642,0.073552,-0.041235,-0.004321,-0.013527,-0.013948,-0.001116,0.042897,0.044485

In [106]:
import pandas as pd

In [107]:
#Read from the csv file into a DataFrame Object
df=pd.read_csv('diabetes.tab.tsv', sep='\t')

In [108]:
#Print the contents 
df.head()

   AGE  SEX   BMI     BP   S1     S2    S3   S4      S5  S6    Y
0   59    2  32.1  101.0  157   93.2  38.0  4.0  4.8598  87  151
1   48    1  21.6   87.0  183  103.2  70.0  3.0  3.8918  69   75
2   72    2  30.5   93.0  156   93.6  41.0  4.0  4.6728  85  141
3   24    1  25.3   84.0  198  131.4  40.0  5.0  4.8903  89  206
4   50    1  23.0  101.0  192  125.4  52.0  4.0  4.2905  80  135

18. use loc to display the data where age>50.

In [ ]:
# cannot be answered

19. use loc to display only bmi and bp for the females only.

In [ ]:
# cannot be answered

20. Get a series of age column from the dataframe object.

In [120]:
# Create a series of age column from a dataframe object
series = df["AGE"]

# Print the contents
print(series)

0      59
1      48
2      72
3      24
4      50
       ..
437    60
438    47
439    60
440    36
441    36
Name: AGE, Length: 442, dtype: int64

21. print the min, max and mean values for the age series.

In [114]:
#Check statistics of data set
df.describe()

,AGE,SEX,BMI,BP,S1,S2,S3,S4,S5,S6,Y
count,442.000000,442.000000,442.000000,442.000000,442.000000,442.000000,442.000000,442.000000,442.000000,442.000000,442.000000
mean,48.518100,1.468326,26.375792,94.647014,189.140271,115.439140,49.788462,4.070249,4.641411,91.260181,152.133484
std,13.109028,0.499561,4.418122,13.831283,34.608052,30.413081,12.934202,1.290450,0.522391,11.496335,77.093005
min,19.000000,1.000000,18.000000,62.000000,97.000000,41.600000,22.000000,2.000000,3.258100,58.000000,25.000000
25%,38.250000,1.000000,23.200000,84.000000,164.250000,96.050000,40.250000,3.000000,4.276700,83.250000,87.000000
50%,50.000000,1.000000,25.700000,93.000000,186.000000,113.000000,48.000000,4.000000,4.620050,91.000000,140.500000
75%,59.000000,2.000000,29.275000,105.000000,209.750000,134.500000,57.750000,5.000000,4.997200,98.000000,211.500000
max,79.000000,2.000000,42.200000,133.000000,301.000000,242.400000,99.000000,9.090000,6.107000,124.000000,346.000000

22.print the basic information about age series

In [122]:
# basic information about age series
series = df["AGE"]

# Print the contents
print(series)

# Confirm the data type
print(series.info())

0      59
1      48
2      72
3      24
4      50
       ..
437    60
438    47
439    60
440    36
441    36
Name: AGE, Length: 442, dtype: int64
<class 'pandas.core.series.Series'>
RangeIndex: 442 entries, 0 to 441
Series name: AGE
Non-Null Count  Dtype
--------------  -----
442 non-null    int64
dtypes: int64(1)
memory usage: 3.6 KB
None

23.print the subset of ages that are less than mean age value

In [129]:
# calculate mean age
mean_age = df["AGE"].mean()
print(mean_age)

# Filter dataframe to include only rows with ages less than the mean
df[df["AGE"]<mean_age].head()

# print dataframe
#print(subset_less_than_mean)

48.51809954751131

   AGE  SEX   BMI    BP   S1     S2    S3   S4      S5  S6    Y
1   48    1  21.6  87.0  183  103.2  70.0  3.0  3.8918  69   75
3   24    1  25.3  84.0  198  131.4  40.0  5.0  4.8903  89  206
5   23    1  22.6  89.0  139   64.8  61.0  2.0  4.1897  68   97
6   36    2  22.0  90.0  160   99.6  50.0  3.0  3.9512  82  138
9   29    1  30.0  85.0  180   93.4  43.0  4.0  5.3845  88  310

24.Sort the age series and print sorted values.

In [134]:
# Sorting AGE series
Sorted_age_values = df["AGE"].sort_values()

# Printing sorted_age_values
print(Sorted_age_values)

26     19
374    19
344    19
79     20
226    20
       ..
211    74
311    75
321    75
402    79
204    79
Name: AGE, Length: 442, dtype: int64

25.print all the unique values from the age series.

In [135]:
# Getting unique values from the "AGE" series
Unique_age_values = df["AGE"].unique()

# Printing the unique values
print(Unique_age_values)

[59 48 72 24 50 23 36 66 60 29 22 56 53 61 34 47 68 38 41 35 25 31 30 19
 42 63 67 32 58 57 62 52 46 21 54 33 27 37 65 39 40 20 44 49 43 64 55 51
 28 45 26 71 79 74 69 70 75 73]